{
    "title": "Правила проведения Чемпионата:",
    "rule-1": "На Чемпионате предлагаются задачи по программированию. Задачи Чемпионата отличаются высоким уровнем научного содержания, требуют для своего выполнения знания различных алгоритмов, умения их эффективно реализовать с использованием различных структур данных и математики.",
    "rule-2": "Решением задачи является программа, написанная на одном из следующих языков программирования: С/С++; Java; Python; Pascal (разные задачи можно решать на разных языках программирования, список языков может быть расширен).",
    "rule-3": "На заключительном очном этапе соревнования у каждого участника будет один компьютер с операционной системой Windows 10.",
    "rule-4": "Для решения задач участники могут использовать следующие языки программирования и соответствующие им среды разработки:",
    "rule-4-subrule-1": "Pascal: Borland Delphi, Free Pascal;",
    "rule-4-subrule-2": "C++17: GNU C++ (MinGW), Code::Blocks;",
    "rule-4-subrule-3": "Java: Eclipse, IntelliJ IDEA.",
    "rule-4-subrule-4": "Python: Python 3, PyCharm.",
    "rule-5": "На заключительном этапе запрещается использовать любую информацию в электронном виде, личные компьютеры и калькуляторы, мобильные средства связи, умные устройства, печатной литературой.",
    "rule-6": "Проверка задач осуществляется при помощи автоматической тестирующей системы (далее- АТС) путем запуска программы на наборе заранее подготовленных Техническим комитетом тестов. В АТС устанавливается ограничение на время работы программы и объем используемой ей оперативной памяти. Решения участников должны соблюдать требованиям формата входных и выходных данных, описанных в условиях задач, удовлетворять ограничениям по времени работы и используемой памяти.",
    "rule-7": "По мере готовности своих решений Участник посылает их в автоматическую тестирующую систему для проверки. После того, как АТС  проверит решение, Участник получает сообщение с результатами тестирования. Это сообщение показывается на экране. Если не возникло ошибки компиляции, то в нем сообщается, что задача зачтена, либо сообщение с указанием ошибки на первом из непройденных тестов.",
    "rule-8": "Сообщения результата тестирования могут быть:",
    "rule-9": "Решение принимается, если оно прошло все тесты. Частичные решения (прошедшие не все тесты) не оцениваются.",
    "rule-10": "Выше в таблице результатов оказывается Участник, решивший большее количество задач. При равенстве количества решенных задач выше оказывается классифицирован Участник, у которого меньше суммарное штрафное время. Штрафное время вычисляется следующим образом: для решенных задач, штрафное время представляет собой время в минутах, прошедшее с начало тура до сдачи задачи, плюс 20 штрафных минут за каждую неудачную попытку сдать задачу. За нерешенные задачи штрафное время не начисляется.",
    "rule-11": "Вопросы по условиям задач задаются через АТС. Вопросы должны формулироваться так, чтобы на них можно было ответить “Да” или “Нет”. Если на вопрос нельзя дать однозначный ответ, либо ответ на вопрос уже содержится в условии задачи, то дается ответ “Без комментариев”.",
    "rule-12-before-link": "Апелляция по результатам отборочных этапов принимается в течение одного календарного дня после проведения отборочного этапа по электронной почте ",
    "rule-12-after-link": ". Апелляция на заключительном этапе проводится по запросу Участника, предоставленного в письменном виде Техническому комитету Чемпионата в течение 30 минут после завершения тура Чемпионата.",
    "rule-13": "На каждом туре этапов Чемпионата Участникам предлагается от 6 до 10 задач. Длительность тура составляет от 3 до 5 астрономических часов. Количество задач в турах и длительность туров определяется Техническим комитетом Чемпионата. Результаты каждого тура публикуются на официальном сайте Чемпионата в течение двух недель после завершения тура.",
    "rule-14": "Логины и пароли к отборочным этапам будут отображены в личном профиле участников на contest.cpfed.kz"
}