{
    "title": "Порядок начисления очков Чемпионата",
    "scoring-rule-1": "В каждом отборочном этапе участникам начисляются очки. Очки рассчитываются по формуле: 100*(solved/max_solved)*(participants-1)/(participants+rank-2) + GP100, где",
    "scoring-rule-2": "solved - количество решенных задач на отборочном этапе;",
    "scoring-rule-3": "max_solved - количество решенных задач у первого результата на отборочном этапе;",
    "scoring-rule-4": "participants - количество участников отборочного этапа;",
    "scoring-rule-5": "rank - место в таблице результатов отборочного этапа;",
    "scoring-rule-6": "GP100 - баллы согласно таблице в Приложении №1 к настоящему Регламенту.",
    "scoring-rule-7": "Очки Участника за все отборочные этапы складываются и формируется рейтинг Чемпионата по очкам.",
    "scoring-rule-8": "По результатам рейтинга Чемпионата за отборочные этапы Федерация и Технический комитет Чемпионата утверждают границу очков для прохождения в заключительный этап Чемпионата и публикует список Участников заключительного этапа.",
    "scoring-rule-9": "По результатам рейтинга Чемпионата за отборочные этапы лучшие 32 человека допускаются к участию в заключительном этапе Чемпионата. ",
    "scoring-rule-10": "По результатам рейтинга Чемпионата без учета 32 лучших участников, лучшие 2 человека в Северном регионе Чемпионата, Западном регионе Чемпионата, Центрально-Восточном регионе Чемпионата и Южном регионе Чемпионата допускаются к участию в заключительном этапе Чемпионата. ",
    "scoring-rule-11": "В Западный регион Чемпионата входят Западно-Казахстанская, Атырауская, Актюбинская, Мангистауская области Республики Казахстан. В Северный регион Чемпионата входят Костанайская, Северо-Казахстанская, Акмолинская, Павлодарская области Республики Казахстан. В Центрально-Восточный регион Чемпионата входят Улытауская, Карагандинская, Абайская, Восточно-Казахстанская области Республики Казахстан. В Южный регион Чемпионата входят Кызылординская, Туркестанская, Жамбылская, Алматинская, Жетысуская области Республики Казахстан и город республиканского значения Шымкент. Города республиканского значения Астана, Алматы не входят в регионы Чемпионата.  ",
    "scoring-rule-12": "Принадлежность участника к региону Чемпионата определяется местом расположения учебного заведения или  работы."
}