{
    "title": "Вопрос-Ответ",
    "faq-1": "Кто может принять участие в Чемпионате?",
    "faq-1-content": "В Чемпионате можно принимать участие с 14 лет и старше. Соревнование для школьников, студентов и взрослых",
    "faq-2": "Как будут проходить отборочные этапы?",
    "faq-2-content": "Отборочные этапы будут проходить в онлайн формате на платформе codeforces.com",
    "faq-3": "Куда придут логин, пароль и ссылка на контест для участия в отборочных этапах?",
    "faq-3-content": "Логин, пароль и ссылка на контест будут отображаться в личном кабинете участника на сайте contest.cpfed.kz утром перед началом тура",
    "faq-4": "Для чего нужен ознакомительный тур?",
    "faq-4-content": "Ознакомительный тур необходим, чтобы познакомиться с тестирующей системой и форматом проведения отборочных туров. Решение тренировочных задач никак не влияет на результаты Чемпионата",
    "faq-5": "По какой системе будут начисляться баллы?",
    "faq-5-content": "Баллы по результатам отборочных туров начисляются по системе GP-100, более подробная информация по ссылке: ",
    "faq-5-link": "https://contest.cpfed.kz/media/Регламент-ЧРК-по-СП.pdf",
    "faq-5-link-title": "регламент",
    "faq-6": "Кто покрывает расходы на проживание, питание и проезд финалистов на заключительном этапе Чемпионата?",
    "faq-6-content": "Проживание и питание в период Чемпионата, а также проезд до Астаны из других городов Казахстана будут финансироваться Федерацией из спонсорских средств",
    "faq-7": "Что делать, если у меня нет опыта в спортивном программировании?",
    "faq-7-content": "Хорошим тренировочным сайтом для начинающих в спортивном программировании является acmp.ru. Также советуем решать раунды на codeforces.com, для начинающих подходят div4, div3 и div2 раунды. Теорию алгоритмов и структур данных можно узнать на сайте e-maxx.ru. Более подробной информацией о том, как изучать спортивное программирование мы будем делиться в наших соц сетях: ",
    "faq-7-link": "https://t.me/cpfed",
    "faq-7-link-title": "https://t.me/cpfed",
    "faq-8": "Какой язык программирования мне следует изучить?",
    "faq-8-content": "Для спортивного программирования подходит любой язык  (например, Python, Pascal, C++, Java). Вы можете использовать тот язык программирования, который вам ближе"    
}