{
    "title": "Чемпионат ұпайларын есептеу тәртібі",
    "scoring-rule-1": "Әр іріктеу кезеңінде қатысушыларға ұпай беріледі. Ұпайлар мына формула бойынша есептеледі: 100*(solved/max_solved)*(participants-1)/(participants+rank-2) + GP100, мұнда",
    "scoring-rule-2": "solved - іріктеу кезеңіндегі шешілген тапсырмалар саны;",
    "scoring-rule-3": "max_solved - іріктеу кезеңіндегі бірінші нәтижедегі шешілген тапсырмалар саны;",
    "scoring-rule-4": "participants - іріктеу кезеңіне қатысушылар саны;",
    "scoring-rule-5": "rank - іріктеу кезеңінің нәтижелер кестесіндегі орны;",
    "scoring-rule-6": "GP100 - осы Регламенттің №1 қосымшасындағы кестеге сәйкес ұпайлар.",
    "scoring-rule-7": "Қатысушының барлық іріктеу кезеңдеріндегі ұпайлары қосылады және ұпай бойынша Чемпионат рейтингі қалыптасады.",
    "scoring-rule-8": "Іріктеу кезеңдері үшін Чемпионат рейтингінің нәтижелері бойынша Федерация мен Чемпионаттың Техникалық комитеті Чемпионаттың соңғы кезеңіне өту үшін ұпай шекарасын бекітеді және соңғы кезеңге қатысушылардың тізімін жариялайды.​",
    "scoring-rule-9": "Іріктеу кезеңдері үшін Чемпионат рейтингінің нәтижелері бойынша үздік 32 адам Чемпионаттың қорытынды кезеңіне қатысуға жіберіледі.",
    "scoring-rule-11": "Чемпионат рейтингінің нәтижелері бойынша Чемпионаттың Солтүстік өңіріндегі, Чемпионаттың Батыс өңіріндегі, Чемпионаттың Орталық-Шығыс өңіріндегі және Чемпионаттың Оңтүстік өңіріндегі үздік 2 адам 32 үздік қатысушыны есептемегенде Чемпионаттың қорытынды кезеңіне қатысуға рұқсат етіледі.",
    "scoring-rule-10": "Чемпионаттың Батыс өңіріне Қазақстан Республикасының Батыс Қазақстан, Атырау, Ақтөбе, Маңғыстау облыстары кіреді. Чемпионаттың Солтүстік өңіріне Қазақстан Республикасының Қостанай, Солтүстік Қазақстан, Ақмола, Павлодар облыстары кіреді. Чемпионаттың Орталық-Шығыс өңіріне Қазақстан Республикасының Ұлытау, Қарағанды, Абай, Шығыс Қазақстан облыстары кіреді. Чемпионаттың Оңтүстік өңіріне Қазақстан Республикасының Қызылорда, Түркістан, Жамбыл, Алматы, Жетісу облыстары және Республикалық маңызы бар Шымкент қаласы кіреді. Республикалық маңызы бар Астана, Алматы қалалары Чемпионат өңірлеріне кірмейді.",
    "scoring-rule-12": "Қатысушының Чемпионат өңіріне тиесілігі оқу орнының немесе жұмыстың орналасқан жерімен анықталады."
}