{
    "title": "Чемпионатты жүргізудің тәртібі:",
    "rule-1": "Чемпионатта бағдарламалау бойынша тапсырмалар ұсынылады. Чемпионаттың тапсырмалары оларды орындау үшін әртүрлі алгоритмдерді білу, оларды әртүрлі деректер құрылымдары мен математиканы қолдана отырып тиімді жүзеге асыру мүмкіндігін талап етіледі.",
    "rule-2": "Тапсырманың шешімі келесі бағдарламалау тілдерінің бірінде жазылған бағдарлама болып табылады: С/С++; Java; Python; Pascal (әр түрлі тапсырмаларды әр түрлі бағдарламалау тілдерінде шешуге болады, тілдер тізімін кеңейтуге болады).",
    "rule-3": "Тапсырмаларды тексеру Техникалық комитет алдын ала дайындаған тесттер жиынтығында бағдарламаны іске қосу жолымен автоматты тестілеу жүйесінің (бұдан әрі – АТЖ) көмегімен жүзеге асырылады. АТЖ-да бағдарламаның жұмыс уақытына және оның пайдаланылатын жедел жадының көлеміне шектеу қойылады. Қатысушылардың шешімдері шарттарда сипатталған тапсырмалардың кіріс және шығыс деректері форматының талаптарын сақтауы, жұмыс уақыты мен пайдаланылатын жадының шектеулерін қанағаттандыруы керек.",
    "rule-4": "Шешімдер дайын болған кезде қатысушы оларды тексеру үшін автоматты тестілеу жүйесіне жібереді. АТЖ шешімді тексергеннен кейін Қатысушы тестілеу нәтижелері туралы хабарлама алады. Бұл хабарлама экранда көрсетіледі. Егер компиляция қатесі болмаса, онда тапсырманың есептелгені немесе өтпеген тесттердің біріншісінде қате көрсетілген хабарлама туралы хабарланады.",
    "rule-5": "Тестілеу нәтижелері туралы хабарламалардың мынадай болуы мүмкін:",
    "rule-5-table": {
        "row-1":{
            "col-1": "Жүйенің хабарламасы",
            "col-2": "Қатенің сипаты"
        },
        "row-2":{
            "col-1": "Жадының шегінен асуы",
            "col-2": "бағдарлама тапсырма шартында көрсетілгеннен көп жадты пайдалануға тырысады"
        },
        "row-3":{
            "col-1": "Уақыттың шегінен асуы",
            "col-2": "бағдарлама тапсырма шартында көрсетілген уақытта жұмысты аяқтаған жоқ"
        },
        "row-4":{
            "col-1": "Орындалу уақытының қателігі",
            "col-2": "бағдарлама нөлдік емес қайтару кодымен аяқталды (0-ге бөлу, массив шегінен шығу және т. б. орын алды)"
        },
        "row-5":{
            "col-1": "Жауап дұрыс емес",
            "col-2": "қате жауап"
        },
        "row-6":{
            "col-1": "Шешім «тоқтап қалды»",
            "col-2": "бағдарлама ұзақ уақыт бойы процессор уақытын мүлдем жұмсаған жоқ"
        },
        "row-7":{
            "col-1": "Тестілеуден бас тарту",
            "col-2": "шешімді іске қосу мүмкін болмады, тестілеу қатесіне байланысты болуы мүмкін, ең ықтимал себебі — бағдарламадағы қате (мысалы, өте үлкен массивтерді пайдалану)"
        }
    },
    "rule-6": "Егер ол барлық тесттерден өтсе, шешім қабылданады. Ішінара (барлық тесттерден өтпеген) шешімдер бағаланбайды.",
    "rule-7": "Нәтижелер кестесінде көп тапсырмаларды шешкен қатысушы жоғарыда көрсетіледі. Шешілген тапсырмалар саны тең болған кезде жалпы айып уақыты аз Қатысушы басымды болады. Айып уақыты келесідей есептеледі: шешілген тапсырмалар үшін айып уақыты турдың басынан бастап тапсырманы тапсыруға дейінгі минуттық уақытты білдіреді, сондай-ақ тапсырманы тапсырудың әр сәтсіз әрекеті үшін 20 айып минутын білдіреді. Шешілмеген тапсырмалар үшін айып уақыты есептелмейді.",
    "rule-8": "Тапсырмалардың шарттары бойынша сұрақтар АТЖ арқылы қойылады. Сұрақтар «Иә» немесе «Жоқ» деп жауап беретіндей етіп тұжырымдалуы керек. Егер сұраққа нақты жауап беру мүмкін болмаса немесе сұраққа жауап тапсырма шартында болса, онда «Түсініктемесіз» деп жауап беріледі.",
    "rule-9-before-link": "Іріктеу кезеңдерінің нәтижелері бойынша апелляция іріктеу кезеңін өткізгеннен кейін күнтізбелік бір күн ішінде admin@cpfed.kz электрондық поштасы арқылы қабылданады.",
    "rule-9-after-link": "Соңғы кезеңде апелляция Чемпионаттың Техникалық комитетіне жазбаша түрде берілген қатысушының сұранысы бойынша Чемпионат туры аяқталғаннан кейін 30 минут ішінде жүргізіледі.",
    "rule-10": "Чемпионат кезеңдерінің әр турында қатысушыларға 6-дан 10-ға дейін тапсырма ұсынылады. Турдың ұзақтығы 3-тен 5-ке дейінгі астрономиялық сағатты құрайды. Турлардағы тапсырмалардың саны мен турлардың ұзақтығы Чемпионаттың техникалық комитетімен анықталады. Әр турдың нәтижелері тур аяқталғаннан кейін екі апта ішінде Чемпионаттың ресми сайтында жарияланады.",
    "rule-11": "Іріктеу кезеңдеріне логиндер мен құпиясөздер contest.cpfed.kz-те қатысушылардың жеке профилінде көрсетіледі",
    "rule-12": "Бірінші іріктеу кезеңінен бір апта бұрын қатысушыларға тестілеу жүйесімен және іріктеу кезеңдерін өткізу форматымен таныстыру мақсатында таныстыру туры ұсынылады. Жаттығу тапсырмаларының шешімі Чемпионат нәтижелеріне әсер етпейді.",
    "rule-13": "Жарыстың соңғы бетпе-бет кезеңінде әр қатысушыда Windows 10 операциялық жүйесі бар бір компьютер болады.",
    "rule-14": "Тапсырмаларды шешу үшін қатысушылар келесі бағдарламалау тілдерін және оларға сәйкес әзірлеу орталарын қолдана алады:",
    "rule-14-subrule-1": "Pascal: Borland Delphi, Free Pascal;",
    "rule-14-subrule-2": "C++17: GNU C++ (MinGW), Code::Blocks;",
    "rule-14-subrule-3": "Java: Eclipse, IntelliJ IDEA.",
    "rule-14-subrule-4": "Python: Python 3, PyCharm.",
    "rule-15": "Соңғы кезеңде кез-келген ақпаратты электронды түрде, жеке компьютерлер мен калькуляторларды, ұялы байланыс құралдарын, ақылды құрылғыларды, баспа әдебиеттерін пайдалануға тыйым салынады."
}