{
    "title": "Сұрақ-Жауап",
    "faq-1": "Чемпионатқа кім қатыса алады?",
    "faq-1-content": "Чемпионатқа 14 жастан бастап қатысуға болады. Оқушыларға, студенттерге және ересектерге арналған жарыс.",
    "faq-2": "Іріктеу кезеңдері қалай өтеді?",
    "faq-2-content": "Іріктеу кезеңдері codeforces.com платформасында онлайн форматта өтеді.",
    "faq-3": "Іріктеу кезеңдеріне қатысу үшін логин, құпиясөз және контестке сілтеме қайда келеді?",
    "faq-3-content": "Логин, құпиясөз және контестке сілтеме тур басталар алдында таңертең contest.cpfed.kz сайтындағы қатысушының жеке кабинетінде көрінеді",
    "faq-4": "Танысу кезеңі не үшін қажет?",
    "faq-4-content": "Танысу кезеңі тестілеу жүйесімен және іріктеу турларын өткізу форматымен танысу үшін қажет. Жаттығу тапсырмаларының шешімі Чемпионат нәтижелеріне әсер етпейді.",
    "faq-5": "Ұпайлар қандай жүйе бойынша есептеледі?",
    "faq-5-content": "Іріктеу турларының нәтижелері бойынша ұпайлар GP-100 жүйесі бойынша есептеледі, толығырақ ақпарат сілтеме бойынша: ",
    "faq-5-link": "https://contest.cpfed.kz/media/Регламент.pdf",
    "faq-5-link-title": "регламент",
    "faq-6": "Чемпионаттың соңғы кезеңінде финалистердің тұру, тамақтану және жол жүру шығындарын кім жабады?",
    "faq-6-content": "Чемпионат кезеңінде тұру және тамақтану, сондай-ақ Қазақстанның басқа қалаларынан Астанаға дейінгі жол жүруді Федерация демеушілік қаражаттан қаржыландырады",
    "faq-7": "Егер менде спорттық бағдарламалау тәжірибесі болмаса ше?",
    "faq-7-content": "acmp.ru платформасын қарап жеңіл есептерінен бастап көріңіз, кейін ресми codeforces.com контесттеріне де қатысып, тәжирібе алып көріңіз. Ал алгоритмді жетілдіру үшін e-maxx.ru сайтын қолдануға кеңес береміз. Спорттық бағдарламалауды қалай үйренуге болатындығы туралы толығырақ ақпаратты біз әлеуметтік желілерде бөлісетін боламыз: ",
    "faq-7-link": "https://t.me/cpfed",
    "faq-7-link-title": "https://t.me/cpfed",
    "faq-8": "Қандай бағдарламалау тілін білген жөн?",
    "faq-8-content": "Спорттық бағдарламауда кез-келген программалау тілі жарамды (Мәселен Python, Pascal, C++, Java). Өзіңізге қай программалау тілі жақын, соны қолдана берсеңіз болады"
}